modm-ext/data.modm.io/docs/svd/header_stm32h562xx.svd
        <register>
          <name>WCCR</name>
          <description>OCTOSPI Write Communication Configuration register</description>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IMODE</name>
              <description>Instruction Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>IDTR</name>
              <description>Instruction Double Transfer Rate</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISIZE</name>
              <description>Instruction Size</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADMODE</name>
              <description>Address Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ADDTR</name>
              <description>Address Double Transfer Rate</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADSIZE</name>
              <description>Address Size</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ABMODE</name>
              <description>Alternate Bytes Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>ABDTR</name>
              <description>Alternate Bytes Double Transfer Rate</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABSIZE</name>
              <description>Alternate Bytes Size</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DMODE</name>
              <description>Data Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DDTR</name>
              <description>Data Double Transfer Rate</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DQSE</name>
              <description>DQS Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WTCR</name>
          <description>OCTOSPI Write Timing Configuration register</description>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCYC</name>
              <description>Number of Dummy Cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WIR</name>
          <description>OCTOSPI Write Instruction register</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSTRUCTION</name>
              <description>Instruction</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WABR</name>
          <description>OCTOSPI Write Alternate Bytes register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ALTERNATE</name>
              <description>Alternate Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HLCR</name>
          <description>OCTOSPI Hyperbus Latency Configuration register</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LM</name>
              <description>Latency Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WZL</name>
              <description>Write Zero Latency</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TACC</name>
              <description>Access Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TRWR</name>
              <description>Read Write Recovery Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM2_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM3_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM3">
      <name>TIM4_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM5_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50000c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM6_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM6">
      <name>TIM7_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM12">
      <name>TIM12_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM13">
      <name>TIM13_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50001c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM13">
      <name>TIM14_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50002000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="WWDG">
      <name>WWDG_S</name>
      <description>WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x50002c00</baseAddress>
    </peripheral>
